{
  "uuid": "0d91ae5d-4b8b-4ba8-b3c2-f678410d9a1f",
  "lastMigration": 27,
  "name": "Mockcoon",
  "endpointPrefix": "",
  "latency": 0,
  "port": 3002,
  "hostname": "",
  "folders": [],
  "routes": [
    {
      "uuid": "dedfb4cd-7792-4251-b224-b7e6d5bfa194",
      "type": "http",
      "documentation": "Get all Articles",
      "method": "get",
      "endpoint": "articles/all",
      "responses": [
        {
          "uuid": "5326342a-5967-4992-8fea-10984254df4a",
          "body": "{}[\n    {\n        \"id\": \"1\",\n        \"title\": \"Disney: Buying With Both Hands As Shares Plunge\",\n        \"content\": \"Summary Disney investors have braved significant downside volatility since DIS fell from its February 2023 highs. DIS has underperformed the S&P 500 and Netflix stock, as investors worry over its ability to chart its growth through its direct-to-consumer business. However, dip buyers returned to help stem the recent slide and bolster the stock against further pessimism, making the current buy levels constructive. Investors who were waiting for a panic selloff in DIS before buying have been given a fantastic opportunity. Ultimate Growth Investing members get exclusive access to our real-world portfolio. See all our investments here » Walt Disney Studios, Paris Razvan  Investors in The Walt Disney Company (NYSE:DIS) have seen DIS underperform the S&P 500 (SPX) (SPY) significantly since my previous update in February 2023. I downgraded my rating as DIS stock reached unconstructive levels. The AI hype has also lifted the Technology sector (XLK) against the market as the Communications sector (XLC) attempts its recovery through the sector leaders such as Google (GOOGL) (GOOG) and Meta Platforms (META), which are also exposed to the AI hype.  However, entertainment-focused stocks such as DIS have underperformed SVOD leader Netflix (NFLX), as it bottomed out last year (which I highlighted). NFLX has steadily recovered from its May-July 2022 lows, gaining over 150% through this week's highs.  Despite the return of celebrated CEO Bob Iger, DIS continues to struggle close to its December 2022 lows as the initial euphoria of Iger's return dissipated.  But why? Isn't Iger supposed to bring Disney Magic back to the House of Mickey Mouse?  Iger's surprise appearance at Apple's (AAPL) WWDC this week helped attract buying sentiments into the embattled stock. Keen investors should know that Disney has forged a partnership for Disney+ to be included in Apple's newly launched mixed reality device from \"day one.\" The Cupertino company launched Vision Pro as its take on mixed reality and has received rave reviews. However, the device is only expected to ship in 2024; therefore, any near-term impact on Disney's operating performance for its direct-to-consumer or DTC segment is not anticipated.  I assessed that dip buyers have likely returned to DIS over the past two weeks, probably seeing an attractive opportunity in the stock, similar to the support zones observed in December.  However, I gleaned that investors are justified to batter DIS into its recent lows, given relatively tepid earnings in its May earnings scorecard. It demonstrated that the company needs to decide whether to focus on growth or profitability.  While Iger and his team are keen to strike a balance on these critical metrics for DTC, I assessed that the execution hasn't been convincing enough to mitigate the long-term decline from its Linear TV segment.  Moreover, the execution risks emanating from Comcast's (CMCSA) stake in Hulu could create another hangover on DIS investors this year. Iger sees the potential in Hulu, as he announced Disney's plans to integrate Hulu with Disney+ for its US customers. However, it remains to be seen at what price Comcast would be willing to divest Hulu, with the AVOD leader \"valued no lower than $27.5 billion.\" Morningstar cautioned investors that Disney isn't likely to \"be willing to pay any price for the Comcast stake.\" As such, with Iger likely staking Disney+'s future on the successful resolution of the stake starting next year, investors must reflect an appropriate discount, given the anticipated challenges.  I assessed that Disney's heavy debt load from its Fox acquisition shouldn't be expected to hamper a recovery in its medium-term profitability. The consensus estimates remain constructive that Disney's DTC segment is expected to report operating profit (on annualized terms) in FY25 (year ending September 2025).  As such, investors buying the current levels must watch the developments over its DTC recovery carefully, as its sum-of-the-parts or SOTP valuation framework hinges mainly on its media segment. Therefore, if DTC could continue its positive profitability trajectory, it should help mitigate near-term headwinds over its Linear TV segment. Moreover, if the economic conditions are better than expected, advertising revenue and affiliate fees could bottom out this year and help lift its free cash flow or FCF over the next two FYs.  Analysts expect Disney to post an FCF of $3.83B in FY23 and possibly improve to $10.35B by FY25. As such, Disney should see a full pre-pandemic recovery of its FCF, which reached $9.83B in FY18.  Therefore, investors looking to participate in DIS at the current levels must have conviction in Iger and his team's execution as Disney reorganizes its DTC to bolster its profitability growth recovery.  DIS price chart (weekly) DIS price chart (weekly) (TradingView)  DIS fell back toward its December lows but was supported by dip buyers over the past two weeks.  However, it needs to prove its ability to continue its profitability, given its \\\\\"D+\\\\\" valuation grade relative to its sector peers, as rated by Seeking Alpha Quant.  Therefore, DIS is rated for growth, as seen in its \\\\\"A-\\\\\" growth grade, based on the optimism in its DTC segment. Morningstar also highlighted that Disney's \\\\\"direct-to-consumer efforts, Disney+, Hotstar, Hulu, and ESPN+ are taking over as the drivers of long-term growth.\\\\\"  Notwithstanding, I view the current levels as constructive, as buying sentiments have improved following the battering since its February highs.  Rating: Buy (Revised from Hold).  Important note: Investors are reminded to do their own due diligence and not rely on the information provided as financial advice. The rating is also not intended to time a specific entry/exit at the point of writing unless otherwise specified.  We Want To Hear From You  Have additional commentary to improve our thesis? Spotted a critical gap in our thesis? Saw something important that we didn’t? Agree or disagree? Comment below and let us know why, and help everyone in the community to learn better!   A Unique Price Action-based Growth Investing Service We believe price action is a leading indicator.  We called the TSLA top in late 2021. We then picked TSLA's bottom in December 2022. We updated members that the NASDAQ had long-term bearish price action signals in November 2021. We told members that the S&P 500 likely bottomed in October 2022. Members navigated the turning points of the market confidently in our service. Members tuned out the noise in the financial media and focused on what really matters: Price Action.\",\n        \"url\": \"https://seekingalpha.com/article/4610475-disney-buying-with-both-hands-as-stock-plunges\",\n        \"imageUrl\": \"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/458117347/image_458117347.jpg?io=getty-c-w1080\",\n        \"date\": \"2023-06-10 23:35:00.241175\",\n        \"author\": \"John Doe\",\n        \"likes\": 14,\n        \"comments\": 309,\n        \"source\": \"Seeking Alpha\",\n        \"sentiment_score\": 0.9,\n        \"sentiment\": \"Negative\",\n        \"tickers\": [\n            \"DIS\"\n        ],\n        \"company_id\": \"1\"\n    }\n]",
          "latency": 0,
          "statusCode": 200,
          "label": "articles json",
          "headers": [],
          "bodyType": "INLINE",
          "filePath": "",
          "databucketID": "",
          "sendFileAsBody": false,
          "rules": [],
          "rulesOperator": "OR",
          "disableTemplating": false,
          "fallbackTo404": false,
          "default": true
        }
      ],
      "enabled": true,
      "responseMode": null
    }
  ],
  "rootChildren": [
    {
      "type": "route",
      "uuid": "dedfb4cd-7792-4251-b224-b7e6d5bfa194"
    }
  ],
  "proxyMode": false,
  "proxyHost": "",
  "proxyRemovePrefix": false,
  "tlsOptions": {
    "enabled": false,
    "type": "CERT",
    "pfxPath": "",
    "certPath": "",
    "keyPath": "",
    "caPath": "",
    "passphrase": ""
  },
  "cors": true,
  "headers": [
    {
      "key": "Content-Type",
      "value": "application/json"
    }
  ],
  "proxyReqHeaders": [
    {
      "key": "",
      "value": ""
    }
  ],
  "proxyResHeaders": [
    {
      "key": "",
      "value": ""
    }
  ],
  "data": []
}